<a href='http://www.scienceacademy.ca'> <img style="float: left;height:70px" src="Logo_SA.png"></a>

# Chicago Payroll Data Exercise Overview

Hi guys, <br>
So far, you have made great progress, Excellent job!<br>
Let's explore real [payroll data of Chicago city](https://www.kaggle.com/chicago/chicago-citywide-payroll-data). This data is available on [kaggle](https://www.kaggle.com) website and can be downloaded using the provided link. However, a copy of dataset is provided in the course material as well. <br>


Please follow the instructions and answer the questions accordingly. <br>
Good luck!<br>

**Links to few similar datasets are given below to explore ang practice your skills.**<br>
&#9758; [City payroll information for all Los Angeles employees since 2013](https://www.kaggle.com/cityofLA/city-payroll-data) <br>
&#9758; [San Francisco city employee salary data](https://www.kaggle.com/kaggle/sf-salaries)<br>
&#9758; [New York City - Citywide Payroll Data](https://www.kaggle.com/new-york-city/nyc-citywide-payroll-data)

**1. Import pandas as pd.**

In [1]:
# Code here please
import pandas as pd

**2. Read City_of_Chicago_Payroll_Data.csv as a dataframe in pay.**

In [2]:
# Code here please
df=pd.read_csv('City_of_Chicago_Payroll_Data.csv')

**3. Show first five records in your data.**

In [3]:
# Code here please
df.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN

**3. Get the overview of your data.<br>**

In [4]:
# Code here please
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32658 entries, 0 to 32657
Data columns (total 8 columns):
Name                 32658 non-null object
Job Titles           32658 non-null object
Department           32658 non-null object
Full or Part-Time    32658 non-null object
Salary or Hourly     32658 non-null object
Typical Hours        7883 non-null float64
Annual Salary        24775 non-null object
Hourly Rate          7883 non-null object
dtypes: float64(1), object(7)
memory usage: 2.0+ MB

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32658 entries, 0 to 32657
Data columns (total 8 columns):
Name                 32658 non-null object
Job Titles           32658 non-null object
Department           32658 non-null object
Full or Part-Time    32658 non-null object
Salary or Hourly     32658 non-null object
Typical Hours        7883 non-null float64
Annual Salary        24775 non-null object
Hourly Rate          7883 non-null object
dtypes: float64(1), object(7)
memory usage: 2.0+ MB

Notice that:<br>
`Typical Hours` is the only float type. <br>
`Typical Hours`, `Annual Salary` and `Hourly Rate` have lots of NaN or null values.

**4. How many 'NaN' you have in each column in your data?**<br>
*Hint: use [<code>isnull()</code>](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.isnull.html)*

In [5]:
# Code here please
df.isnull().sum()

Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        24775
Annual Salary         7883
Hourly Rate          24775
dtype: int64

Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        24775
Annual Salary         7883
Hourly Rate          24775
dtype: int64

**5. Output the statistics for your dataset.**

In [6]:
# Code here please
df.describe(include='all')

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
count,32658,32658,32658,32658,32658,7883.000000,24775,7883
unique,32350,1095,36,2,2,NaN,1038,167
top,"HERNANDEZ, JUAN C",POLICE OFFICER,POLICE,F,Salary,NaN,$90024.00,$35.60
freq,5,9393,12973,30676,24775,NaN,2368,1404
mean,NaN,NaN,NaN,NaN,NaN,34.698719,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,9.145553,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,10.000000,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,20.000000,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
count,32658,32658,32658,32658,32658,7883.000000,24775,7883
unique,32350,1095,36,2,2,NaN,1038,167
top,"HERNANDEZ, JUAN C",POLICE OFFICER,POLICE,F,Salary,NaN,$90024.00,$35.60
freq,5,9393,12973,30676,24775,NaN,2368,1404
mean,NaN,NaN,NaN,NaN,NaN,34.698719,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,9.145553,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,10.000000,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,20.000000,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN

**6. What are the maximum, minimum and average Typical Hours? (use 'Typical Hours' column)**<br>
*Do you remember, pandas ignore NA/NaN/NULL values by default?* <br>
<code>pay['Typical Hours'].dropna().mean()<code> should gives the same mean :) You may want to confirm!

In [7]:
# Code here please
print('Max Typical Hours are: ',df['Typical Hours'].max())
print('Min Typical Hours are: ',df['Typical Hours'].min())
print('Average Typical Hours are: ',df['Typical Hours'].mean())

Max Typical Hours are:  40.0
Min Typical Hours are:  10.0
Average Typical Hours are:  34.69871876189268

Max Typical Hours are: 40.0
Min Typical Hours are: 10.0
Mean/Avg Typical Hours are: 34.69871876189268

**7. How many employees are on salary and how many are working on hourly basis?**<br>
*Hint: Group the data on 'Salary or Hourly' column. Instead of whole dataset, you can take the single column as input as well.*

In [8]:
# Code here please
df.groupby(by='Salary or Hourly',axis=0).count()

,Name,Job Titles,Department,Full or Part-Time,Typical Hours,Annual Salary,Hourly Rate
Salary or Hourly,,,,,,,
Hourly,7883,7883,7883,7883,7883,0,7883
Salary,24775,24775,24775,24775,0,24775,0

,Name,Job Titles,Department,Full or Part-Time,Typical Hours,Annual Salary,Hourly Rate
Salary or Hourly,,,,,,,
Hourly,7883,7883,7883,7883,7883,0,7883
Salary,24775,24775,24775,24775,0,24775,0

In [6]:
df

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN
5,"DUBERT, TOMASZ",PARAMEDIC I/C,FIRE,F,Salary,NaN,$91080.00,NaN
6,"EDWARDS, TIM P",LIEUTENANT,FIRE,F,Salary,NaN,$114846.00,NaN
7,"ELKINS, ERIC J",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN
8,"ESTRADA, LUIS F",POLICE OFFICER,POLICE,F,Salary,NaN,$96060.00,NaN
9,"EWING, MARIE A",CLERK III,POLICE,F,Salary,NaN,$53076.00,NaN
10,"FINN, SEAN P",FIREFIGHTER,FIRE,F,Salary,NaN,$87006.00,NaN
11,"FITCH, JORDAN M",LAW CLERK,LAW,F,Hourly,35.0,NaN,$14.51
12,"FREELON, CHERYL N",POLICE OFFICER,POLICE,F,Salary,NaN,$96060.00,NaN
13,"GRAFF, KEVIN M",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN
14,"GUNN, ISSAC J",FIREFIGHTER-EMT,FIRE,F,Salary,NaN,$80868.00,NaN
15,"HARRIS, DANIEL J",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN
16,"HATTULA, CARL J",SERGEANT,POLICE,F,Salary,NaN,$107988.00,NaN
17,"HILL, LATINA P",PARAMEDIC,FIRE,F,Salary,NaN,$72510.00,NaN
18,"HOLLER, JOEL P",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN
19,"HROMA JR, JOHN",SERGEANT,POLICE,F,Salary,NaN,$107988.00,NaN
20,"JACKSON, ERIC",SERGEANT,POLICE,F,Salary,NaN,$107988.00,NaN
21,"JOYCE, SEAN G",CAPTAIN,POLICE,F,Salary,NaN,$132876.00,NaN
22,"KING, WARSHAW",CAPTAIN-EMT,FIRE,F,Salary,NaN,$136794.00,NaN
23,"KWONG, NORMAN P",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN
24,"LEVEK, NATHAN L",PARAMEDIC,FIRE,F,Salary,NaN,$72510.00,NaN
25,"MACK, PAUL C",LIEUTENANT,POLICE,F,Salary,NaN,$125190.00,NaN
26,"PETERS, JOSEPH M",PARAMEDIC,FIRE,F,Salary,NaN,$72510.00,NaN
27,"MOORE, TED D",POLICE OFFICER,POLICE,F,Salary,NaN,$87006.00,NaN
28,"SIMON, JOSEPH G",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN
29,"MULLINS, JOHN T",PARAMEDIC,FIRE,F,Salary,NaN,$72510.00,NaN
...,...,...,...,...,...,...,...,...
32628,"ZUNIGA, NOE",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN
32629,"ZUNIGA, OSCAR",POLICE OFFICER,POLICE,F,Salary,NaN,$80016.00,NaN
32630,"ZUNIGA, RONALD",POLICE OFFICER,POLICE,F,Salary,NaN,$90024.00,NaN
32631,"ZUNIGA, THOMAS",GENERAL LABORER - DSS,STREETS & SAN,F,Hourly,40.0,NaN,$21.43
32632,"ZUNIGA, VICENTE",FIREFIGHTER-EMT,FIRE,F,Salary,NaN,$92274.00,NaN
32633,"ZUPAN, BILL M",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN
32634,"ZUPANCIC, KELLY",POLICE OFFICER,POLICE,F,Salary,NaN,$72510.00,NaN
32635,"ZURAWSKI, CAROL A",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,$22.14
32636,"ZURAWSKI, JEFFREY",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,F,Hourly,40.0,NaN,$48.85
32637,"ZURAWSKI, MAC Z",SANITATION LABORER,STREETS & SAN,F,Hourly,40.0,NaN,$36.21
32638,"ZURAWSKI, MARY E",POLICE OFFICER,POLICE,F,Salary,NaN,$96060.00,NaN
32639,"ZUREK, FRANCIS",ELECTRICAL MECHANIC,OEMC,F,Hourly,40.0,NaN,$46.10
32640,"ZUREK, MARY H",SENIOR PUBLIC INFORMATION OFFICER,FINANCE,F,Salary,NaN,$85008.00,NaN
32641,"ZURITA, ADRIEL",POLICE OFFICER,POLICE,F,Salary,NaN,$72510.00,NaN
32642,"ZVANJA, TINA M",LEGAL SECRETARY,LAW,F,Salary,NaN,$76932.00,NaN
32643,"ZWARYCZ MANN, IRENE A",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,$17.50
32644,"ZWARYCZ, THOMAS J",POOL MOTOR TRUCK DRIVER,WATER MGMNT,F,Hourly,40.0,NaN,$35.60
32645,"ZWIESLER, MATTHEW",AIRPORT OPERATIONS SUPVSR I,AVIATION,F,Salary,NaN,$76896.00,NaN
32646,"ZWIT, JEFFREY J",POLICE OFFICER,POLICE,F,Salary,NaN,$87006.00,NaN
32647,"ZWOLFER, MATTHEW W",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN
32648,"ZYCH, MATEUSZ",POLICE OFFICER,POLICE,F,Salary,NaN,$68616.00,NaN
32649,"ZYDEK, BRYAN",POLICE OFFICER,POLICE,F,Salary,NaN,$84054.00,NaN
32650,"ZYGADLO, JOHN P",MACHINIST (AUTOMOTIVE),GENERAL SERVICES,F,Hourly,40.0,NaN,$46.35
32651,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,F,Hourly,40.0,NaN,$48.85
32652,"ZYGMUNT, DAWID",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN
32653,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,F,Salary,NaN,$90024.00,NaN
32654,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN
32655,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,$87006.00,NaN
32656,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,$93354.00,NaN
32657,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,$115932.00,NaN

**8. Which department has maximum no of employees? **

In [9]:
# Code here please
df['Department'].value_counts().head(1)

POLICE    12973
Name: Department, dtype: int64

POLICE    12973
FIRE       4800
Name: Department, dtype: int64

**9. How many employees are on Salary and how many are on Hourly in the Police department?**

In [10]:
# Code here please
df[df['Department'] == 'POLICE'].groupby(by='Salary or Hourly').count()['Department']

Salary or Hourly
Hourly       32
Salary    12941
Name: Department, dtype: int64

Salary or Hourly
Hourly       32
Salary    12941
Name: Department, dtype: int64

**10. What are the mean, max and min salaries?**<br>
use <code>.str and replace()</code><br>
Create a new column name "Salaries" and separate the number from dollar sign as float .<br>
Hint: [pandas.series.str](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.str.split.html) and [Stackoverflow link](https://stackoverflow.com/questions/38516481/trying-to-remove-commas-and-dollars-signs-with-pandas-in-python)

In [11]:
# Code here please
df['Salaries'] = df['Annual Salary'].str.replace('$','')

In [12]:
# Code here please
df['Salaries'] = df['Salaries'].astype(float)

In [13]:
print('Min: ',df['Salaries'].min())
print('Max: ',df['Salaries'].max())
print('Mean: ',df['Salaries'].mean())

Min:  0.96
Max:  300000.0
Mean:  87512.78024137241

min: 0.96
max: 300000.0
mean: 87512.78024137241

In [25]:
# Code here please

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN,107790.0
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0

**11. Find an employee who has the maximum salary. **<br>
Don't use the max number you got above, write a code for general condition. <br>
Try with [<code>idxmax()</code>](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.idxmax.html) as well!}

In [14]:
# Code here please
df[df['Salaries'] == df['Salaries'].max()]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salaries
8310,"EVANS, GINGER S",COMMISSIONER OF AVIATION,AVIATION,F,Salary,NaN,$300000.00,NaN,300000.0

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary
8310,"EVANS, GINGER S",COMMISSIONER OF AVIATION,AVIATION,F,Salary,NaN,$300000.00,NaN,300000.0

**12. Find an employee who has the minimum salary. **<br>
Use [<code>idxmin()</code>](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.idxmin.html) as well!

In [16]:
# Code here please
df[df['Salaries']== df['Salaries'].min()]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salaries
15387,"KOCH, STEVEN",ADMINISTRATIVE SECRETARY,MAYOR'S OFFICE,F,Salary,NaN,$0.96,NaN,0.96

In [24]:
df.iloc[df['Salaries'].idxmin()]

Name                           KOCH,  STEVEN
Job Titles           ADMINISTRATIVE SECRETARY
Department                     MAYOR'S OFFICE
Full or Part-Time                           F
Salary or Hourly                       Salary
Typical Hours                             NaN
Annual Salary                           $0.96
Hourly Rate                               NaN
Salaries                                 0.96
Name: 15387, dtype: object

Name                           KOCH,  STEVEN
Job Titles           ADMINISTRATIVE SECRETARY
Department                     MAYOR'S OFFICE
Full or Part-Time                           F
Salary or Hourly                       Salary
Typical Hours                             NaN
Annual Salary                           $0.96
Hourly Rate                               NaN
Salary                                   0.96
Name: 15387, dtype: object

In [29]:
df.head(5)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32658 entries, 0 to 32657
Data columns (total 9 columns):
Name                 32658 non-null object
Job Titles           32658 non-null object
Department           32658 non-null object
Full or Part-Time    32658 non-null object
Salary or Hourly     32658 non-null object
Typical Hours        7883 non-null float64
Annual Salary        24775 non-null object
Hourly Rate          7883 non-null object
Salaries             24775 non-null float64
dtypes: float64(2), object(7)
memory usage: 2.2+ MB

**13. What are the mean, max and min Hourly Rate?**<br>
use <code>.str and replace()</code><br>
Hint:
Once again, create a new column name "H_Rate" and separate the number from dollar sign as float .<br>

In [34]:
# Code here please
df['H_Rate'] = df['Hourly Rate'].str.replace('$','')
df['H_Rate']= df['H_Rate'].astype(float)

In [38]:
# Code here please
print(f'Mean hourly rate ${df["H_Rate"].mean()}')
print(f'Max hourly rate ${df["H_Rate"].max()}')
print(f'Min hourly rate ${df["H_Rate"].min()}')

Mean hourly rate $32.86819231257292
Max hourly rate $96.0
Min hourly rate $2.65

In [50]:
df.head(100)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salaries,H_Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN,107790.0,NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0,NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN,114324.0,NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN,76932.0,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN,111474.0,NaN
5,"DUBERT, TOMASZ",PARAMEDIC I/C,FIRE,F,Salary,NaN,$91080.00,NaN,91080.0,NaN
6,"EDWARDS, TIM P",LIEUTENANT,FIRE,F,Salary,NaN,$114846.00,NaN,114846.0,NaN
7,"ELKINS, ERIC J",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0,NaN
8,"ESTRADA, LUIS F",POLICE OFFICER,POLICE,F,Salary,NaN,$96060.00,NaN,96060.0,NaN
9,"EWING, MARIE A",CLERK III,POLICE,F,Salary,NaN,$53076.00,NaN,53076.0,NaN
10,"FINN, SEAN P",FIREFIGHTER,FIRE,F,Salary,NaN,$87006.00,NaN,87006.0,NaN
11,"FITCH, JORDAN M",LAW CLERK,LAW,F,Hourly,35.0,NaN,$14.51,NaN,14.51
12,"FREELON, CHERYL N",POLICE OFFICER,POLICE,F,Salary,NaN,$96060.00,NaN,96060.0,NaN
13,"GRAFF, KEVIN M",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN,111474.0,NaN
14,"GUNN, ISSAC J",FIREFIGHTER-EMT,FIRE,F,Salary,NaN,$80868.00,NaN,80868.0,NaN
15,"HARRIS, DANIEL J",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN,48078.0,NaN
16,"HATTULA, CARL J",SERGEANT,POLICE,F,Salary,NaN,$107988.00,NaN,107988.0,NaN
17,"HILL, LATINA P",PARAMEDIC,FIRE,F,Salary,NaN,$72510.00,NaN,72510.0,NaN
18,"HOLLER, JOEL P",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0,NaN
19,"HROMA JR, JOHN",SERGEANT,POLICE,F,Salary,NaN,$107988.00,NaN,107988.0,NaN
20,"JACKSON, ERIC",SERGEANT,POLICE,F,Salary,NaN,$107988.00,NaN,107988.0,NaN
21,"JOYCE, SEAN G",CAPTAIN,POLICE,F,Salary,NaN,$132876.00,NaN,132876.0,NaN
22,"KING, WARSHAW",CAPTAIN-EMT,FIRE,F,Salary,NaN,$136794.00,NaN,136794.0,NaN
23,"KWONG, NORMAN P",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0,NaN
24,"LEVEK, NATHAN L",PARAMEDIC,FIRE,F,Salary,NaN,$72510.00,NaN,72510.0,NaN
25,"MACK, PAUL C",LIEUTENANT,POLICE,F,Salary,NaN,$125190.00,NaN,125190.0,NaN
26,"PETERS, JOSEPH M",PARAMEDIC,FIRE,F,Salary,NaN,$72510.00,NaN,72510.0,NaN
27,"MOORE, TED D",POLICE OFFICER,POLICE,F,Salary,NaN,$87006.00,NaN,87006.0,NaN
28,"SIMON, JOSEPH G",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0,NaN
29,"MULLINS, JOHN T",PARAMEDIC,FIRE,F,Salary,NaN,$72510.00,NaN,72510.0,NaN
...,...,...,...,...,...,...,...,...,...,...
70,"ABDULLAH, LAKENYA N",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,$17.50,NaN,17.50
71,"ABDULLAH, RASHAD",ELECTRICAL MECHANIC-AUTO-POLICE MTR MNT,GENERAL SERVICES,F,Hourly,40.0,NaN,$46.10,NaN,46.10
72,"ABDULSATTAR, MUDHAR",CIVIL ENGINEER II,WATER MGMNT,F,Salary,NaN,$63480.00,NaN,63480.0,NaN
73,"ABDUL-SHAKUR, TAHIR",GENERAL LABORER - DSS,STREETS & SAN,F,Hourly,40.0,NaN,$20.77,NaN,20.77
74,"ABEJERO, JASON V",POLICE OFFICER,POLICE,F,Salary,NaN,$90024.00,NaN,90024.0,NaN
75,"ABERCROMBIE IV, EARL S",PARAMEDIC I/C,FIRE,F,Salary,NaN,$78792.00,NaN,78792.0,NaN
76,"ABERCROMBIE, TIMOTHY",MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,$35.60,NaN,35.60
77,"ABIOYE, ADEWOLE A",LIBRARY ASSOCIATE - HOURLY,PUBLIC LIBRARY,P,Hourly,20.0,NaN,$25.10,NaN,25.10
78,"ABNEY, PATRICK",POLICE OFFICER,POLICE,F,Salary,NaN,$72510.00,NaN,72510.0,NaN
79,"ABOUELKHEIR, HASSAN A",SENIOR PROGRAMMER/ANALYST,FAMILY & SUPPORT,F,Salary,NaN,$110064.00,NaN,110064.0,NaN
80,"ABRAHAM, GIRLEY T",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,$110064.00,NaN,110064.0,NaN
81,"ABRAHAM, GODWIN K",ENGINEERING TECHNICIAN V,BUSINESS AFFAIRS,F,Salary,NaN,$101592.00,NaN,101592.0,NaN
82,"ABRAHAM, NANCY A",POLICE OFFICER,POLICE,F,Salary,NaN,$76266.00,NaN,76266.0,NaN
83,"ABRAM, ANTHONY A",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN,48078.0,NaN
84,"ABRAMAVICIUS, ANNA A",SUPERVISING TRAFFIC CONTROL AIDE,OEMC,F,Salary,NaN,$60852.00,NaN,60852.0,NaN
85,"ABRAMS, DANIELLE T",SANITATION LABORER,STREETS & SAN,F,Hourly,40.0,NaN,$36.21,NaN,36.21
86,"ABRAMSKI, JOHN E",AMBULANCE COMMANDER,FIRE,F,Salary,NaN,$128970.00,NaN,128970.0,NaN
87,"ABRAMSON, NICHOLAS",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN,48078.0,NaN
88,"ABRAMS, SAMUEL A",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,$35.60,NaN,35.60
89,"ABRATANSKI, MARK A",FIREFIGHTER-EMT,FIRE,F,Salary,NaN,$89148.00,NaN,89148.0,NaN
90,"ABREU, DILAN",SEWER BRICKLAYER,WATER MGMNT,F,Hourly,40.0,NaN,$44.88,NaN,44.88
91,"ABREU, EDWIN",TREE TRIMMER,STREETS & SAN,F,Hourly,40.0,NaN,$37.25,NaN,37.25
92,"ABREU, ROBERTO J",TRAFFIC SIGNAL REPAIRMAN,TRANSPORTN,F,Salary,NaN,$101712.00,NaN,101712.0,NaN
93,"ABREU, ROSITA",PERSONAL COMPUTER OPERATOR III,HEALTH,F,Salary,NaN,$70092.00,NaN,70092.0,NaN
94,"ABREU, VICTOR",FIREFIGHTER-EMT,FIRE,F,Salary,NaN,$99324.00,NaN,99324.0,NaN
95,"ABRON, FLOYD",POLICE OFFICER,POLICE,F,Salary,NaN,$90024.00,NaN,90024.0,NaN
96,"ABRONS, KENNETH L",ELECTRICAL MECHANIC,AVIATION,F,Hourly,40.0,NaN,$46.10,NaN,46.10
97,"ABUBAKER, MOHAMMED G",SENIOR ENVIRONMENTAL INSPECTOR,HEALTH,F,Salary,NaN,$80568.00,NaN,80568.0,NaN
98,"ABUDAYEH, ELIAS",POLICE OFFICER,POLICE,F,Salary,NaN,$72510.00,NaN,72510.0,NaN
99,"ABUHASHISH, AWWAD",PLUMBER,WATER MGMNT,F,Hourly,40.0,NaN,$48.25,NaN,48.25

In [34]:
# Let's see how the data look like now!

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,H_Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN,107790.0,NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0,NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN,114324.0,NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN,76932.0,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN,111474.0,NaN

In [35]:
# Code here please

min H_Rate : 2.65
max H_Rate : 96.0
mean H_Rate : 32.86819231257292

**14. How many employees are getting max Hourly Rate? **

In [43]:
# Code here please
df[df['H_Rate']==df['H_Rate'].max()].count()

Name                 1
Job Titles           1
Department           1
Full or Part-Time    1
Salary or Hourly     1
Typical Hours        1
Annual Salary        0
Hourly Rate          1
Salaries             0
H_Rate               1
dtype: int64

Name                 1
Job Titles           1
Department           1
Full or Part-Time    1
Salary or Hourly     1
Typical Hours        1
Annual Salary        0
Hourly Rate          1
Salary               0
H_Rate               1
dtype: int64

**15. Who is getting max Hourly Rate?**

In [42]:
# Code here please
df[df['H_Rate']==df['H_Rate'].max()]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salaries,H_Rate
14317,"JONES, JOHN W",PSYCHIATRIST,HEALTH,F,Hourly,35.0,NaN,$96.00,NaN,96.0

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,H_Rate
14317,"JONES, JOHN W",PSYCHIATRIST,HEALTH,F,Hourly,35.0,NaN,$96.00,NaN,96.0

**16. How many employees are earning less than the average Hourly Rate?**

In [45]:
# Code here please
df[df['H_Rate'] < df['H_Rate'].mean()].count()

Name                 2791
Job Titles           2791
Department           2791
Full or Part-Time    2791
Salary or Hourly     2791
Typical Hours        2791
Annual Salary           0
Hourly Rate          2791
Salaries                0
H_Rate               2791
dtype: int64

2791

In [47]:
df.head(30)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salaries,H_Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN,107790.0,NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0,NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN,114324.0,NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN,76932.0,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN,111474.0,NaN
5,"DUBERT, TOMASZ",PARAMEDIC I/C,FIRE,F,Salary,NaN,$91080.00,NaN,91080.0,NaN
6,"EDWARDS, TIM P",LIEUTENANT,FIRE,F,Salary,NaN,$114846.00,NaN,114846.0,NaN
7,"ELKINS, ERIC J",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0,NaN
8,"ESTRADA, LUIS F",POLICE OFFICER,POLICE,F,Salary,NaN,$96060.00,NaN,96060.0,NaN
9,"EWING, MARIE A",CLERK III,POLICE,F,Salary,NaN,$53076.00,NaN,53076.0,NaN
10,"FINN, SEAN P",FIREFIGHTER,FIRE,F,Salary,NaN,$87006.00,NaN,87006.0,NaN
11,"FITCH, JORDAN M",LAW CLERK,LAW,F,Hourly,35.0,NaN,$14.51,NaN,14.51
12,"FREELON, CHERYL N",POLICE OFFICER,POLICE,F,Salary,NaN,$96060.00,NaN,96060.0,NaN
13,"GRAFF, KEVIN M",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN,111474.0,NaN
14,"GUNN, ISSAC J",FIREFIGHTER-EMT,FIRE,F,Salary,NaN,$80868.00,NaN,80868.0,NaN
15,"HARRIS, DANIEL J",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN,48078.0,NaN
16,"HATTULA, CARL J",SERGEANT,POLICE,F,Salary,NaN,$107988.00,NaN,107988.0,NaN
17,"HILL, LATINA P",PARAMEDIC,FIRE,F,Salary,NaN,$72510.00,NaN,72510.0,NaN
18,"HOLLER, JOEL P",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0,NaN
19,"HROMA JR, JOHN",SERGEANT,POLICE,F,Salary,NaN,$107988.00,NaN,107988.0,NaN
20,"JACKSON, ERIC",SERGEANT,POLICE,F,Salary,NaN,$107988.00,NaN,107988.0,NaN
21,"JOYCE, SEAN G",CAPTAIN,POLICE,F,Salary,NaN,$132876.00,NaN,132876.0,NaN
22,"KING, WARSHAW",CAPTAIN-EMT,FIRE,F,Salary,NaN,$136794.00,NaN,136794.0,NaN
23,"KWONG, NORMAN P",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0,NaN
24,"LEVEK, NATHAN L",PARAMEDIC,FIRE,F,Salary,NaN,$72510.00,NaN,72510.0,NaN
25,"MACK, PAUL C",LIEUTENANT,POLICE,F,Salary,NaN,$125190.00,NaN,125190.0,NaN
26,"PETERS, JOSEPH M",PARAMEDIC,FIRE,F,Salary,NaN,$72510.00,NaN,72510.0,NaN
27,"MOORE, TED D",POLICE OFFICER,POLICE,F,Salary,NaN,$87006.00,NaN,87006.0,NaN
28,"SIMON, JOSEPH G",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0,NaN
29,"MULLINS, JOHN T",PARAMEDIC,FIRE,F,Salary,NaN,$72510.00,NaN,72510.0,NaN

**17. How many employees are paid hourly and they have full-time job?**

In [52]:
# Code here please
df[(df['Full or Part-Time'] == 'F') & (df['H_Rate'])].count()

Name                 5906
Job Titles           5906
Department           5906
Full or Part-Time    5906
Salary or Hourly     5906
Typical Hours        5906
Annual Salary           0
Hourly Rate          5906
Salaries                0
H_Rate               5906
dtype: int64

5906

**18. Find the full-time employees who are working at hourly rate of $10.00?**

In [55]:
# Code here please
df[(df['H_Rate'] == 10) & (df['Full or Part-Time'] == 'F')]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salaries,H_Rate
1232,"AYALA JR, JESUS",STUDENT INTERN,HUMAN RESOURCES,F,Hourly,35.0,NaN,$10.00,NaN,10.0
4522,"CERVANTES, BIANCA A",STUDENT INTERN,BUDGET & MGMT,F,Hourly,35.0,NaN,$10.00,NaN,10.0
6476,"DAVILA, ROBERTO A",ALDERMANIC AIDE,CITY COUNCIL,F,Hourly,35.0,NaN,$10.00,NaN,10.0
16474,"LEVY, ETHAN",CLERK CITY COUNCIL,CITY COUNCIL,F,Hourly,35.0,NaN,$10.00,NaN,10.0

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,H_Rate
1232,"AYALA JR, JESUS",STUDENT INTERN,HUMAN RESOURCES,F,Hourly,35.0,NaN,$10.00,NaN,10.0
4522,"CERVANTES, BIANCA A",STUDENT INTERN,BUDGET & MGMT,F,Hourly,35.0,NaN,$10.00,NaN,10.0
6476,"DAVILA, ROBERTO A",ALDERMANIC AIDE,CITY COUNCIL,F,Hourly,35.0,NaN,$10.00,NaN,10.0
16474,"LEVY, ETHAN",CLERK CITY COUNCIL,CITY COUNCIL,F,Hourly,35.0,NaN,$10.00,NaN,10.0

**19. How many unique Job Titles are there in the data?**

In [58]:
# Code here please
df['Job Titles'].nunique()

1095

1095

**20. What was the average Salary of the employees in each department? **

In [68]:
# Code here please
df.groupby(by='Department',sort=False)['Salaries'].mean().sort_values(ascending=False)

Department
DoIT                     99681.029703
BUILDINGS                98864.833534
COPA                     98784.705882
FIRE                     97762.348662
MAYOR'S OFFICE           96165.512308
BOARD OF ETHICS          94552.500000
IPRA                     94429.285714
BUDGET & MGMT            93925.395349
HUMAN RELATIONS          93778.588235
TRANSPORTN               89976.896061
WATER MGMNT              89894.111803
COMMUNITY DEVELOPMENT    88363.257143
TREASURER                88062.652174
POLICE                   87836.025349
CULTURAL AFFAIRS         87048.909091
POLICE BOARD             86136.000000
HEALTH                   85488.210938
LAW                      84582.814404
STREETS & SAN            84347.775701
INSPECTOR GEN            84030.666667
PROCUREMENT              83278.243902
GENERAL SERVICES         83095.528390
DISABILITIES             82431.724138
LICENSE APPL COMM        80568.000000
BUSINESS AFFAIRS         80446.425000
HUMAN RESOURCES          79851.761194
FAMILY & SUPPORT         79013.588785
ADMIN HEARNG             78912.947368
AVIATION                 76140.018777
FINANCE                  73276.364662
OEMC                     73153.778221
PUBLIC LIBRARY           71273.288136
CITY CLERK               69762.439024
ANIMAL CONTRL            66089.684211
CITY COUNCIL             63577.172069
BOARD OF ELECTION        56051.142857
Name: Salaries, dtype: float64

Department
ADMIN HEARNG             78912.947368
ANIMAL CONTRL            66089.684211
AVIATION                 76140.018777
BOARD OF ELECTION        56051.142857
BOARD OF ETHICS          94552.500000
BUDGET & MGMT            93925.395349
BUILDINGS                98864.833534
BUSINESS AFFAIRS         80446.425000
CITY CLERK               69762.439024
CITY COUNCIL             63577.172069
COMMUNITY DEVELOPMENT    88363.257143
COPA                     98784.705882
CULTURAL AFFAIRS         87048.909091
DISABILITIES             82431.724138
DoIT                     99681.029703
FAMILY & SUPPORT         79013.588785
FINANCE                  73276.364662
FIRE                     97762.348662
GENERAL SERVICES         83095.528390
HEALTH                   85488.210938
HUMAN RELATIONS          93778.588235
HUMAN RESOURCES          79851.761194
INSPECTOR GEN            84030.666667
IPRA                     94429.285714
LAW                      84582.814404
LICENSE APPL COMM        80568.000000
MAYOR'S OFFICE           96165.512308
OEMC                     73153.778221
POLICE                   87836.025349
POLICE BOARD             86136.000000
PROCUREMENT              83278.243902
PUBLIC LIBRARY           71273.288136
STREETS & SAN            84347.775701
TRANSPORTN               89976.896061
TREASURER                88062.652174
WATER MGMNT              89894.111803
Name: Salary, dtype: float64

**21. What is the job title of 'AGAR,  BULENT B'?** please note, there are two spaces between AGAR, and BULENT.

In [70]:
# Code here please
df['Job Titles'][df['Name'] == 'AGAR,  BULENT B']

230    CHIEF ENGINEER OF SEWERS
Name: Job Titles, dtype: object

230    CHIEF ENGINEER OF SEWERS
Name: Job Titles, dtype: object

**22. What are the top most common job titles?**

In [84]:
# Code here please
df.groupby(by='Job Titles',sort=False)['Job Titles'].count().sort_values(ascending=False).head(5)

Job Titles
POLICE OFFICER                            9393
FIREFIGHTER-EMT                           1424
SERGEANT                                  1118
POOL MOTOR TRUCK DRIVER                    996
POLICE OFFICER (ASSIGNED AS DETECTIVE)     845
Name: Job Titles, dtype: int64

POLICE OFFICER                            9393
FIREFIGHTER-EMT                           1424
SERGEANT                                  1118
POOL MOTOR TRUCK DRIVER                    996
POLICE OFFICER (ASSIGNED AS DETECTIVE)     845
Name: Job Titles, dtype: int64

**23. How many people have the word 'officer' in their job title? (This is pretty tricky) **

In [85]:
# Code here please
df

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salaries,H_Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN,107790.0,NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0,NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN,114324.0,NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN,76932.0,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN,111474.0,NaN
5,"DUBERT, TOMASZ",PARAMEDIC I/C,FIRE,F,Salary,NaN,$91080.00,NaN,91080.0,NaN
6,"EDWARDS, TIM P",LIEUTENANT,FIRE,F,Salary,NaN,$114846.00,NaN,114846.0,NaN
7,"ELKINS, ERIC J",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0,NaN
8,"ESTRADA, LUIS F",POLICE OFFICER,POLICE,F,Salary,NaN,$96060.00,NaN,96060.0,NaN
9,"EWING, MARIE A",CLERK III,POLICE,F,Salary,NaN,$53076.00,NaN,53076.0,NaN
10,"FINN, SEAN P",FIREFIGHTER,FIRE,F,Salary,NaN,$87006.00,NaN,87006.0,NaN
11,"FITCH, JORDAN M",LAW CLERK,LAW,F,Hourly,35.0,NaN,$14.51,NaN,14.51
12,"FREELON, CHERYL N",POLICE OFFICER,POLICE,F,Salary,NaN,$96060.00,NaN,96060.0,NaN
13,"GRAFF, KEVIN M",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN,111474.0,NaN
14,"GUNN, ISSAC J",FIREFIGHTER-EMT,FIRE,F,Salary,NaN,$80868.00,NaN,80868.0,NaN
15,"HARRIS, DANIEL J",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN,48078.0,NaN
16,"HATTULA, CARL J",SERGEANT,POLICE,F,Salary,NaN,$107988.00,NaN,107988.0,NaN
17,"HILL, LATINA P",PARAMEDIC,FIRE,F,Salary,NaN,$72510.00,NaN,72510.0,NaN
18,"HOLLER, JOEL P",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0,NaN
19,"HROMA JR, JOHN",SERGEANT,POLICE,F,Salary,NaN,$107988.00,NaN,107988.0,NaN
20,"JACKSON, ERIC",SERGEANT,POLICE,F,Salary,NaN,$107988.00,NaN,107988.0,NaN
21,"JOYCE, SEAN G",CAPTAIN,POLICE,F,Salary,NaN,$132876.00,NaN,132876.0,NaN
22,"KING, WARSHAW",CAPTAIN-EMT,FIRE,F,Salary,NaN,$136794.00,NaN,136794.0,NaN
23,"KWONG, NORMAN P",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0,NaN
24,"LEVEK, NATHAN L",PARAMEDIC,FIRE,F,Salary,NaN,$72510.00,NaN,72510.0,NaN
25,"MACK, PAUL C",LIEUTENANT,POLICE,F,Salary,NaN,$125190.00,NaN,125190.0,NaN
26,"PETERS, JOSEPH M",PARAMEDIC,FIRE,F,Salary,NaN,$72510.00,NaN,72510.0,NaN
27,"MOORE, TED D",POLICE OFFICER,POLICE,F,Salary,NaN,$87006.00,NaN,87006.0,NaN
28,"SIMON, JOSEPH G",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0,NaN
29,"MULLINS, JOHN T",PARAMEDIC,FIRE,F,Salary,NaN,$72510.00,NaN,72510.0,NaN
...,...,...,...,...,...,...,...,...,...,...
32628,"ZUNIGA, NOE",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN,48078.0,NaN
32629,"ZUNIGA, OSCAR",POLICE OFFICER,POLICE,F,Salary,NaN,$80016.00,NaN,80016.0,NaN
32630,"ZUNIGA, RONALD",POLICE OFFICER,POLICE,F,Salary,NaN,$90024.00,NaN,90024.0,NaN
32631,"ZUNIGA, THOMAS",GENERAL LABORER - DSS,STREETS & SAN,F,Hourly,40.0,NaN,$21.43,NaN,21.43
32632,"ZUNIGA, VICENTE",FIREFIGHTER-EMT,FIRE,F,Salary,NaN,$92274.00,NaN,92274.0,NaN
32633,"ZUPAN, BILL M",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN,114324.0,NaN
32634,"ZUPANCIC, KELLY",POLICE OFFICER,POLICE,F,Salary,NaN,$72510.00,NaN,72510.0,NaN
32635,"ZURAWSKI, CAROL A",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,$22.14,NaN,22.14
32636,"ZURAWSKI, JEFFREY",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,F,Hourly,40.0,NaN,$48.85,NaN,48.85
32637,"ZURAWSKI, MAC Z",SANITATION LABORER,STREETS & SAN,F,Hourly,40.0,NaN,$36.21,NaN,36.21
32638,"ZURAWSKI, MARY E",POLICE OFFICER,POLICE,F,Salary,NaN,$96060.00,NaN,96060.0,NaN
32639,"ZUREK, FRANCIS",ELECTRICAL MECHANIC,OEMC,F,Hourly,40.0,NaN,$46.10,NaN,46.10
32640,"ZUREK, MARY H",SENIOR PUBLIC INFORMATION OFFICER,FINANCE,F,Salary,NaN,$85008.00,NaN,85008.0,NaN
32641,"ZURITA, ADRIEL",POLICE OFFICER,POLICE,F,Salary,NaN,$72510.00,NaN,72510.0,NaN
32642,"ZVANJA, TINA M",LEGAL SECRETARY,LAW,F,Salary,NaN,$76932.00,NaN,76932.0,NaN
32643,"ZWARYCZ MANN, IRENE A",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,$17.50,NaN,17.50
32644,"ZWARYCZ, THOMAS J",POOL MOTOR TRUCK DRIVER,WATER MGMNT,F,Hourly,40.0,NaN,$35.60,NaN,35.60
32645,"ZWIESLER, MATTHEW",AIRPORT OPERATIONS SUPVSR I,AVIATION,F,Salary,NaN,$76896.00,NaN,76896.0,NaN
32646,"ZWIT, JEFFREY J",POLICE OFFICER,POLICE,F,Salary,NaN,$87006.00,NaN,87006.0,NaN
32647,"ZWOLFER, MATTHEW W",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN,114324.0,NaN
32648,"ZYCH, MATEUSZ",POLICE OFFICER,POLICE,F,Salary,NaN,$68616.00,NaN,68616.0,NaN
32649,"ZYDEK, BRYAN",POLICE OFFICER,POLICE,F,Salary,NaN,$84054.00,NaN,84054.0,NaN
32650,"ZYGADLO, JOHN P",MACHINIST (AUTOMOTIVE),GENERAL SERVICES,F,Hourly,40.0,NaN,$46.35,NaN,46.35
32651,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,F,Hourly,40.0,NaN,$48.85,NaN,48.85
32652,"ZYGMUNT, DAWID",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN,48078.0,NaN
32653,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,F,Salary,NaN,$90024.00,NaN,90024.0,NaN
32654,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN,48078.0,NaN
32655,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,$87006.00,NaN,87006.0,NaN
32656,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,$93354.00,NaN,93354.0,NaN
32657,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,$115932.00,NaN,115932.0,NaN

In [86]:
def find_string(title):
    if 'officer' in title.lower():
        return True
    else:
        return False

In [87]:
sum(df['Job Titles'].apply(lambda x: find_string(x)))

11101

# Great Job!